import os

from dotenv import load_dotenv

load_dotenv()


# =========================
# BOT
# =========================

BOT_TOKEN = os.getenv("BOT_TOKEN")

MONGO_URI = os.getenv("MONGO_URI")


# =========================
# GROUPS
# =========================

MAIN_GROUP_1_ID = int(os.getenv("MAIN_GROUP_1_ID"))

MAIN_GROUP_2_ID = int(os.getenv("MAIN_GROUP_2_ID"))

SECRET_GROUP_ID = int(os.getenv("SECRET_GROUP_ID"))


MAIN_GROUP_1_LINK = os.getenv("MAIN_GROUP_1_LINK")

MAIN_GROUP_2_LINK = os.getenv("MAIN_GROUP_2_LINK")


OWNER_USERNAME = os.getenv("OWNER_USERNAME")


# =========================
# START
# =========================

START_TEXT = """
👋 സ്വാഗതം.

🔒 സീക്രട്ട് ചാനലിൽ പ്രവേശിക്കാൻ ആദ്യം താഴെയുള്ള രണ്ട് Main Group-കളിലും അംഗമാകണം.

ശേഷം "അക്സസ് പരിശോധിക്കുക" ബട്ടൺ അമർത്തുക.
"""


# =========================
# BUTTON
# =========================

CHECK_BUTTON = "✅ അക്സസ് പരിശോധിക്കുക"


# =========================
# FAILED
# =========================

FAILED_TEXT = """
❌ പരിശോധന പരാജയപ്പെട്ടു.

സീക്രട്ട് ചാനലിൽ പ്രവേശിക്കാൻ ആദ്യം രണ്ട് Main Group-കളിലും അംഗമാകണം.

രണ്ടും Join ചെയ്ത ശേഷം വീണ്ടും
'അക്സസ് പരിശോധിക്കുക'
അമർത്തുക.
"""


# =========================
# SUCCESS
# =========================

SUCCESS_TEXT = """
✅ പരിശോധന വിജയിച്ചു!

🎉 നിങ്ങൾക്ക് ഇപ്പോൾ സീക്രട്ട് ചാനലിൽ പ്രവേശിക്കാം.

👇 താഴെയുള്ള ബട്ടൺ ഉപയോഗിക്കുക.

⚠️ ഈ ലിങ്ക് ഒരാൾക്ക് മാത്രം ഉപയോഗിക്കാനാകും.
മറ്റാർക്കും ഉപയോഗിക്കാൻ കഴിയില്ല.
"""


# =========================
# ALREADY
# =========================

ALREADY_SECRET_TEXT = """
✅ നിങ്ങൾ ഇതിനകം സീക്രട്ട് ചാനലിൽ അംഗമാണ്.
"""


# =========================
# REMOVED
# =========================

REMOVED_TEXT = """
🚫 നിങ്ങളുടെ സീക്രട്ട് ചാനൽ പ്രവേശനം റദ്ദാക്കി.

കാരണം:
രണ്ട് Main Group-കളിൽ ഏതെങ്കിലും ഒന്നിൽ നിന്നും നിങ്ങൾ പുറത്തായി.

വീണ്ടും രണ്ട് Main Group-കളിലും Join ചെയ്ത ശേഷം Bot-ൽ വന്ന്

✅ അക്സസ് പരിശോധിക്കുക

അമർത്തിയാൽ പുതിയ Single Use Link ലഭിക്കും.
"""


# =========================
# AUTO DELETE
# =========================

AUTO_DELETE_MESSAGES = True

KEEP_LAST_MESSAGES = 2
